# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [9]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [14]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [18]:
# Count by hand. (lol kidding)
print(f'{len(df_food)} rows of data')

125 rows of data

What are the columns and their types in this data set?

In [21]:
# Show the column names and their types.
print(df_food.dtypes)

GPA                  object
Gender                int64
breakfast             int64
calories_chicken      int64
calories_day        float64
                     ...
type_sports          object
veggies_day           int64
vitamins              int64
waffle_calories       int64
weight               object
Length: 61, dtype: object

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [25]:
# Remove ‚Äòem.
df_food = df_food[['calories_day', 'weight', 'Gender']]
df_food
# now we only have calories_day, weight, & Gender

     calories_day                    weight  Gender
0             NaN                       187       2
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
..            ...                       ...     ...
120           4.0                       156       1
121           2.0                       180       1
122           NaN                       120       1
123           4.0                       135       2
124           NaN                       135       1

[125 rows x 3 columns]

What about `NaN`s? How many are there?

In [28]:
# Count ‚Äòem.
print(f'Total NaNs in the data set is: {df_food.isnull().sum().sum()}\n')
print(f'Total for each column:\n{df_food.isnull().sum()}')

Total NaNs in the data set is: 21

Total for each column:
calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [31]:
# Drop ‚Äòem.
df_food = df_food.dropna()
print(df_food)
# sanity check for NaNs
print(f'\nSanity Check: \n{df_food.isnull().sum()}')

     calories_day                    weight  Gender
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
5             3.0                       190       1
..            ...                       ...     ...
118           3.0                       140       1
119           3.0                       185       2
120           4.0                       156       1
121           2.0                       180       1
123           4.0                       135       2

[104 rows x 3 columns]

Sanity Check:
calories_day    0
weight          0
Gender          0
dtype: int64

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [34]:
# Fix that.
# the weight column is a object data type so we have to convert it into float
# because weight is numerical but discrete 
def string_to_number(input_str):
    try:
        return(float(input_str))
    except:
        return None

# converts all values in the column into an integer and if they are not
# able to become integers they become NaN values
df_food['weight'] = df_food.weight.apply(string_to_number)

# drop invalid values such as: "Not sure, 240"
df_food = df_food.dropna()
df_food

/var/folders/jk/dwrd0x2n3h93kymvmp4c10sc0000gn/T/ipykernel_18814/3150468910.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_food['weight'] = df_food.weight.apply(string_to_number)

     calories_day  weight  Gender
1             3.0   155.0       1
4             2.0   190.0       1
5             3.0   190.0       1
6             3.0   180.0       2
7             3.0   137.0       1
..            ...     ...     ...
118           3.0   140.0       1
119           3.0   185.0       2
120           4.0   156.0       1
121           2.0   180.0       1
123           4.0   135.0       2

[101 rows x 3 columns]

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [37]:
# Savey save!
df_food.to_csv('data/df_food_cleaned.csv', index=False)

# 
exported_df = pd.read_csv('data/df_food_cleaned.csv')
exported_df.head()

   calories_day  weight  Gender
0           3.0   155.0       1
1           2.0   190.0       1
2           3.0   190.0       1
3           3.0   180.0       2
4           3.0   137.0       1

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [41]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv', delimiter='\t')
df_salary.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

In [45]:
df_salary.to_csv('data/df_manager_salary.csv', index=False)
df_salary = pd.read_csv('data/df_manager_salary.csv')

### Explore

You know the drill.

How much data did you just load?

In [49]:
# Count by hand. I‚Äôm dead serious.
print(f'{len(df_salary)} rows of data')

28062 rows of data

What are the columns and their types?

In [52]:
# Show the column names and their types.
print(df_salary.dtypes)

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [55]:
# Rename ‚Äòem.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race
df_salary.columns = ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_compensation', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed', 'gender', 'race']
print(f'New Column Names: \n{list(df_salary.columns)}')

New Column Names:
['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_compensation', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed', 'gender', 'race']

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [59]:
# List the unique industries and a count of their instances.
df_salary.industry.value_counts()

Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: industry, Length: 1219, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [62]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
# all_industries = list(df_salary.industry.unique())
# all_industries

df_salary_tech = df_salary[(df_salary['industry'] == 'Computing or Tech') | (df_salary['industry'] == 'Tech')]

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [65]:
# Sanity Check 
print(df_salary_tech.industry.unique())
df_salary_tech.industry.value_counts()

['Computing or Tech' 'Tech']

Computing or Tech    4699
Tech                    3
Name: industry, dtype: int64

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [68]:
# Filtery filter for just the jobs that pay in USD!

#df_salary_tech.head()
df_salary_USA = df_salary_tech[df_salary_tech['currency'] == 'USD']

# checking...
df_salary_USA.currency.unique()

array(['USD'], dtype=object)

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [71]:
# We did filter for USD, so if we do a count of each unique country in descending 
# count order, the relevant value(s) should show up at the top.

top_5_USA = df_salary_USA.country.value_counts(ascending=False).head().index

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [75]:
# Replace them all with 'US'.
df_salary_USA_5 = df_salary_USA[df_salary_USA['country'].isin(top_5_USA)].copy() # removes copy warning
df_salary_USA_5['country'] = 'US'

Have a look at the count of each unique country again now.

In [78]:
# Count again.
df_salary_USA_5.country.value_counts()

US    3411
Name: country, dtype: int64

Did you notice anything interesting?

In [81]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.

In [83]:

# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.
df_salary_USA_5.country.nunique()

1

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [86]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.

df_salary_USA_5.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values(by='mean')

TypeError: Could not convert 75,00070,00072,00052,00029,120105,000120,0005200095000 to numeric

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [105]:
# Fix it.

# def string_to_number(input_str):
#     try:
#         return(int(input_str))
#     except:
#         return None
        
df_salary_USA_5['salary'] = pd.to_numeric(df_salary_USA_5['salary'], errors='coerce')

# print(df_salary_USA_5.dtypes)
# NOW SALARY IS A FLOAT TYPE

# remove the NANs
df_salary_USA_5 = df_salary_USA_5.dropna(subset=['salary'])

Let‚Äôs try that again.

In [107]:
# Try it again. Yeah!

# Sorted values in ascending order!
df_salary_USA_5.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values(by='mean')

                                     min           mean        max
state
South Carolina                   40000.0   40000.000000    40000.0
Nebraska                         43000.0   70920.000000   140000.0
Alabama                          52000.0   73500.000000    95000.0
Arkansas                         60000.0   77333.333333    95000.0
New Hampshire                       55.0   78611.000000   120000.0
Louisiana                        75000.0   80500.000000    84000.0
California, Maryland             81500.0   81500.000000    81500.0
Missouri                            80.0   82870.818182   200000.0
Oklahoma                         36958.0   84802.571429   180000.0
Indiana                          15000.0   85400.000000   140000.0
Ohio                             42000.0   87213.333333   179000.0
Maine                            50000.0   90000.000000   114000.0
Tennessee                        61500.0   91750.000000   144000.0
Michigan                         41600.0   95492.857143   235000.0
New Mexico                       82000.0   95733.333333   115200.0
Arizona                          35000.0   96400.000000   142000.0
North Carolina                   29000.0   98151.785714   165000.0
Rhode Island                     76000.0   99475.000000   122950.0
Minnesota                        52124.0  101064.941176   210000.0
Iowa                             63000.0  101200.000000   142000.0
Kentucky                         62000.0  102500.000000   125000.0
Texas                            10700.0  102694.339623   185000.0
Utah                             33280.0  105023.333333   176000.0
Vermont                          91250.0  105625.000000   120000.0
Colorado                         49400.0  108376.470588   165000.0
District of Columbia, Virginia  109200.0  109200.000000   109200.0
Kansas                           41500.0  109666.666667   167000.0
Montana                          65000.0  112666.666667   145000.0
Pennsylvania                     52000.0  114867.187500   237000.0
Idaho                            82000.0  115666.666667   170000.0
Maryland                         62000.0  116642.100000   162000.0
Georgia                          29120.0  116956.875000   242000.0
Louisiana, Washington           117000.0  117000.000000   117000.0
Illinois                         36000.0  119357.656250   228800.0
Virginia                         58750.0  119575.392857   378000.0
West Virginia                   120000.0  120000.000000   120000.0
Oregon                           16200.0  123994.871795   230000.0
Nevada                          107100.0  124550.000000   142000.0
Massachusetts                    41000.0  125423.695652   400000.0
New Jersey                       90000.0  129750.000000   192000.0
New Jersey, New York            135000.0  137500.000000   140000.0
Washington                          72.0  138048.222222   300000.0
Wisconsin                            1.0  142952.040000   920000.0
District of Columbia             59000.0  145000.000000   200000.0
New York                         14000.0  148213.564356   590000.0
California                           0.0  155216.905063   520000.0
Connecticut                      68000.0  170137.500000   270000.0
California, Colorado            176000.0  176000.000000   176000.0
California, Oregon              200000.0  200000.000000   200000.0
Florida                          28800.0  229567.650000  2600000.0

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [131]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.

# CONVERTED INTO DATATIME FORMAT
# df_salary_USA_5['timestamp'] = pd.to_datetime(df_salary_USA_5['timestamp'])

# dt.year will return the year of the timestamp!
df_salary_years = df_salary_USA_5[df_salary_USA_5['timestamp'].dt.year.isin([2021, 2022, 2023])]
df_salary_years

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8999,2021-04-27 17:02:03,35-44,Computing or Tech,Software Development Lead,NaN,1.0,130000.0,USD,NaN,NaN,US,Wisconsin,Madison,8 - 10 years,8 - 10 years,Master's degree,Man,White
11900,2021-04-28 06:41:31,45-54,Computing or Tech,Account Manager,NaN,55.0,12.0,USD,NaN,Base + commission,US,New Hampshire,Manchester,21 - 30 years,8 - 10 years,College degree,Woman,White
15238,2021-04-28 16:45:53,18-24,Computing or Tech,Product Marketer,NaN,0.0,0.0,USD,NaN,Start up without funding. Compensation is in s...,US,California,Santa Clara,1 year or less,1 year or less,College degree,Man,Asian or Asian American
15885,2021-04-28 17:22:37,25-34,Computing or Tech,Chief Data Scientist,NaN,240.0,100.0,USD,NaN,Additional compensation is expected value of o...,US,California,Oakland,5-7 years,5-7 years,PhD,Man,White
18140,2021-04-28 22:49:19,25-34,Computing or Tech,Technical Writer,NaN,72.0,0.0,USD,NaN,NaN,US,Washington,Silverdale,8 - 10 years,2 - 4 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27949,2023-03-28 18:41:56,25-34,Computing or Tech,Software Engineer II,NaN,116421.0,3000.0,USD,NaN,NaN,US,Maryland,Bethesda,2 - 4 years,2 - 4 years,College degree,Man,White
27956,2023-04-18 09:26:31,35-44,Computing or Tech,Porting Agent,Port phone numbers from one carrier to another,60000.0,5000.0,USD,NaN,NaN,US,Georgia,Atlanta,21 - 30 years,2 - 4 years,Some college,Man,"Hispanic, Latino, or Spanish origin"
27960,2023-05-09 17:57:30,45-54,Computing or Tech,Junior Data Analyst,NaN,65000.0,0.0,USD,NaN,NaN,US,Virginia,Richmond,21 - 30 years,1 year or less,College degree,Man,White
27961,2023-05-28 16:10:53,45-54,Computing or Tech,Data Analyst,NaN,65000.0,0.0,USD,NaN,NaN,US,New York,Bronx,21 - 30 years,8 - 10 years,College degree,Man,Black or African American
27975,2023-09-08 12:35:45,18-24,Computing or Tech,intern,NaN,35000.0,0.0,USD,NaN,NaN,US,Texas,Dallas,1 year or less,1 year or less,Master's degree,Man,Asian or Asian American

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [133]:
# df_salary.head()

# make currency only for the US
df_salary_US = df_salary[df_salary['currency'] == 'USD']

# Get our top 5 from the US
top_5_USA = df_salary.country.value_counts(ascending=False).head().index
# taking only the top 5 and putting it in new variable
df_salary_US_5 = df_salary_US[df_salary_US['country'].isin(top_5_USA)].copy() # removes copy warning
# transform all values in country into just 'US'
df_salary_US_5['country'] = 'US'

# making sure country is only value is 'US'
print(df_salary_US_5['salary'])

0         55,000
2         34,000
3         62,000
4         60,000
5         62,000
          ...
28042      77651
28043    2600000
28044      60000
28057     135000
28058     109000
Name: salary, Length: 20200, dtype: object

In [161]:
# TURN INTO NUMERICE. (Note: Next time just make a clean csv and save it)
df_salary_US_5['salary'] = pd.to_numeric(df_salary_US_5['salary'], errors='coerce')

# REMOVE THE NANS
df_salary_US_5 = df_salary_US_5.dropna(subset=['salary'])

df_salary_US_5.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values('mean')

,min,mean,max
state,,,
"Maryland, New York",14000.0,14000.000000,14000.0
"Alabama, California",29120.0,29120.000000,29120.0
"District of Columbia, Washington",35000.0,35000.000000,35000.0
"Delaware, Pennsylvania",35000.0,35000.000000,35000.0
South Dakota,33000.0,37750.000000,42500.0
...,...,...,...
"Louisiana, Washington",117000.0,117000.000000,117000.0
"California, District of Columbia, Illinois, Iowa, Maryland, Minnesota",130000.0,130000.000000,130000.0
"New Jersey, New York",135000.0,138666.666667,141000.0
"California, Colorado",176000.0,176000.000000,176000.0
"California, Oregon",200000.0,200000.000000,200000.0

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

In [166]:
# FUNCTION TO FORMAT EACH CELL IN VALUE IN SALARY
def format_currency(x):
    return "${:,.2f}".format(x)

formated = df_salary_US_5['salary'].apply(format_currency)
formated

97              $58.00
895             $38.00
968             $61.00
1607           $130.00
4081            $35.00
             ...
28042       $77,651.00
28043    $2,600,000.00
28044       $60,000.00
28057      $135,000.00
28058      $109,000.00
Name: salary, Length: 5461, dtype: object

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

In [190]:
import us
# GIVES ME ALL VALID STATES EASILY!! us is so cool btw
# print([state.name for state in us.STATES])
# OUTPUT: 50

valid_states = [state.name for state in us.STATES]

filtered_df = df_salary_US_5[df_salary_US_5['state'].isin(valid_states)]
print(len(filtered_df['state'].unique()))
print(f'All States in a list: \n{filtered_df['state'].unique()}')
# OUTPUT: 50 *** ALSO 50 *** and gets rid of the non-single-states

50

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)